#делаем два класса которые работают с апи достают данные
# класс который работает с файликом добавить удалить получает
# класс вакансии который обрабатывает данные и создает экземпляры классов
#1 достать данные с сумерджоба
#2 достать с хх
#3 достать с двух сайтов
#отфильстровать все по ключевому слову, зарплате , имени вакансии
# введите топ вакансий сколько вывести
#уже в записанном файле вызывается сортировка по зарплате
# проверка что есть доступ к апи



#2 достать с хх обработать через обработчик вакансий и записать все в файл
#далее выбираю меню отсортировать по з.п функция или отфильтровать по ключевому слову например джуниор и напечатал пользователю